{
  "loan_types": {
    "permanent-loans": [
      {"q": "What is a permanent commercial loan?", "a": "A permanent commercial loan is long-term financing (5-25 years) for stabilized, income-producing commercial properties. Unlike bridge or construction loans, permanent loans feature fixed or floating rates with full amortization schedules, providing predictable debt service for property owners."},
      {"q": "What are the typical rates for permanent commercial loans?", "a": "Permanent commercial loan rates typically range from 5.34% to 8.25%, depending on the lender type, property quality, borrower strength, and market conditions. Life insurance companies and agency lenders (Fannie Mae, Freddie Mac) generally offer the most competitive rates for qualifying properties."},
      {"q": "What is the maximum LTV for a permanent commercial loan?", "a": "Most permanent commercial loans offer up to 75% loan-to-value (LTV), though agency multifamily programs can go up to 80% LTV. LTV limits depend on the lender type, property type, and borrower qualifications."},
      {"q": "Can I get a non-recourse permanent loan?", "a": "Yes. Non-recourse permanent loans are available from life insurance companies, CMBS conduits, agency lenders, and select banks. Non-recourse means the borrower is not personally liable beyond standard carve-out guarantees for fraud, environmental issues, and other bad acts."},
      {"q": "What property types qualify for permanent financing?", "a": "Virtually all stabilized commercial property types qualify for permanent financing, including multifamily apartments, industrial warehouses, retail shopping centers, office buildings, hospitality, self-storage, and mixed-use assets. The key requirement is stable occupancy and cash flow."},
      {"q": "How long does it take to close a permanent commercial loan?", "a": "Permanent commercial loans typically close in 45-90 days from application, depending on the lender and property complexity. Bank loans may close faster (45-60 days), while life insurance company and CMBS loans typically require 60-90 days for underwriting, appraisal, and legal review."}
    ],
    "construction-loans": [
      {"q": "How do commercial construction loans work?", "a": "Commercial construction loans are short-term facilities (12-36 months) that fund the development of new buildings or major renovations. The loan is drawn in stages as construction milestones are completed, with interest-only payments during the build period. Upon completion, the borrower refinances into permanent financing or sells the property."},
      {"q": "What is the typical loan-to-cost ratio for construction loans?", "a": "Construction loans typically offer 65-80% of total project cost (loan-to-cost or LTC), depending on the lender, borrower experience, and project type. The remaining 20-35% must come from borrower equity, though mezzanine or preferred equity can fill part of the gap."},
      {"q": "Do I need experience to get a construction loan?", "a": "Most lenders require borrowers to demonstrate relevant development experience for construction loans. First-time developers may need to partner with an experienced co-sponsor or general contractor, or work with private lenders who are more flexible on experience requirements."},
      {"q": "What are construction loan interest rates?", "a": "Construction loan rates typically range from 6.79% to 13.04%, depending on the lender type and project risk profile. Bank construction loans for experienced developers are at the lower end, while debt fund and private lender rates are higher but offer more flexibility."},
      {"q": "What is a construction-to-permanent loan?", "a": "A construction-to-permanent loan (or mini-perm) combines construction financing with a built-in permanent loan conversion upon project completion. This eliminates the need to refinance separately, saving time and closing costs, though terms may be less competitive than standalone permanent financing."},
      {"q": "How are construction loan draws managed?", "a": "Construction loan draws are released based on completed work verified by an independent inspector. The borrower submits draw requests with supporting documentation, the lender's inspector verifies the work, and funds are released (typically within 5-10 business days). An interest reserve is usually built into the loan to cover debt service during construction."}
    ],
    "bridge-loans": [
      {"q": "What is a commercial bridge loan?", "a": "A commercial bridge loan is short-term financing (6-36 months) designed to 'bridge' a property from its current state to permanent financing eligibility. Common uses include acquiring properties that need stabilization, funding renovations and lease-up, or providing quick capital for time-sensitive opportunities."},
      {"q": "How fast can a bridge loan close?", "a": "Bridge loans can close in as little as 2-4 weeks, compared to 45-90 days for permanent financing. This speed makes bridge loans ideal for competitive acquisition situations, auction purchases, and other time-sensitive transactions."},
      {"q": "What are typical bridge loan rates?", "a": "Bridge loan rates typically range from 6.79% to 13.04%, depending on the lender, leverage level, and property risk profile. Rates are higher than permanent financing to compensate for the shorter term and transitional nature of the asset."},
      {"q": "Can I get a non-recourse bridge loan?", "a": "Yes. Many debt funds and institutional bridge lenders offer non-recourse bridge loans, particularly for larger transactions ($5M+). Non-recourse bridge loans are subject to standard carve-out guarantees similar to permanent financing."},
      {"q": "What is the exit strategy for a bridge loan?", "a": "The typical exit strategy for a bridge loan is refinancing into permanent financing once the property is stabilized (fully leased and generating sufficient cash flow). Alternatively, the exit may be a property sale, construction loan conversion, or another bridge loan if more time is needed."},
      {"q": "What collateral is required for a bridge loan?", "a": "Bridge loans are secured by the commercial property itself, just like permanent financing. Lenders may also require personal guarantees (recourse), though non-recourse options are available. Additional collateral such as cross-collateralization or cash reserves may be required for higher-risk situations."}
    ],
    "sba-loans": [
      {"q": "What is an SBA 504 loan?", "a": "An SBA 504 loan is a government-backed financing program for owner-occupied commercial real estate. It features a unique two-loan structure: a first mortgage from a bank (50% LTV) and a second position loan from a Certified Development Company backed by the SBA (40% LTV), requiring only 10% borrower equity."},
      {"q": "What is the difference between SBA 504 and 7(a) loans?", "a": "SBA 504 loans are specifically for real estate and major equipment with fixed rates, while SBA 7(a) loans are more flexible and can fund real estate, working capital, equipment, and business acquisitions. 504 loans offer lower rates but more restrictions, while 7(a) loans offer broader use of proceeds."},
      {"q": "Who qualifies for SBA loans?", "a": "SBA loans are available to for-profit small businesses that occupy at least 51% of the property (existing buildings) or 60% (new construction). The business must meet SBA size standards, be located in the U.S., and the owner must have reasonable equity to invest."},
      {"q": "What are the current SBA loan rates?", "a": "SBA 504 loan rates are based on 5, 10, or 20-year Treasury rates plus a fixed spread, typically ranging from 5.54% to 6.50%. SBA 7(a) rates can be fixed or variable, typically prime rate plus 1.50% to 2.75%, with current effective rates around 7.50% to 9.75%."},
      {"q": "How long does it take to close an SBA loan?", "a": "SBA loans typically take 60-120 days to close due to the dual-lender structure (504) or SBA authorization process (7(a)). The timeline includes bank underwriting, SBA approval, appraisal, environmental review, and legal documentation."},
      {"q": "Can I use an SBA loan for investment property?", "a": "No. SBA loans require the business to occupy at least 51% of the property. They cannot be used for pure investment properties. However, the remaining 49% can be leased to other tenants, making SBA loans excellent for businesses that want to own their space and generate rental income."}
    ],
    "mezzanine": [
      {"q": "What is mezzanine financing in commercial real estate?", "a": "Mezzanine financing is subordinate debt that sits between senior mortgage debt and equity in the capital stack. Secured by a pledge of ownership interest rather than a property lien, mezzanine debt allows borrowers to increase total leverage to 80-90% of value while reducing their equity requirement."},
      {"q": "What is the difference between mezzanine debt and preferred equity?", "a": "Mezzanine debt is a loan secured by a pledge of the borrower's ownership interest, with fixed payments and foreclosure rights. Preferred equity is an actual equity investment with a preferred return, participating in ownership rather than lending. Both fill the gap between senior debt and common equity."},
      {"q": "What are typical mezzanine loan rates?", "a": "Mezzanine loan rates typically range from 10% to 18%, reflecting the higher risk position behind senior debt. Rates depend on the total leverage, property type, sponsor strength, and market conditions. Preferred equity returns are similar but may include additional upside participation."},
      {"q": "When should I consider mezzanine financing?", "a": "Consider mezzanine financing when you need higher leverage than senior lenders will provide alone, want to reduce your equity requirement for an acquisition or development, are executing a value-add or development strategy, or need to recapitalize and pull equity from an existing property."},
      {"q": "Does the senior lender need to approve mezzanine debt?", "a": "Yes. Most senior lenders require approval of any subordinate financing, including mezzanine debt. This involves an intercreditor agreement between the senior and mezzanine lenders that outlines rights, remedies, and priorities in the event of default."}
    ],
    "specialty": [
      {"q": "What qualifies as a specialty commercial property?", "a": "Specialty properties include asset types outside the traditional multifamily, industrial, retail, office, and hospitality categories. Examples include self-storage, data centers, marinas, religious facilities, entertainment venues, car washes, funeral homes, and other niche property types with specialized operations."},
      {"q": "Is it harder to finance specialty properties?", "a": "Specialty properties can be more challenging to finance because fewer lenders have experience underwriting them. However, with the right broker relationships and deal structuring, competitive financing is available. CLS CRE's network of 1,000+ lenders includes specialists in virtually every niche property type."},
      {"q": "What rates can I expect for specialty property financing?", "a": "Rates for specialty properties vary widely depending on the asset class, ranging from 5.54% for well-established assets like self-storage to 13%+ for more niche or transitional specialty properties. Strong operating history and creditworthy tenants help achieve better terms."},
      {"q": "Can I get non-recourse financing for specialty properties?", "a": "Non-recourse financing is available for select specialty property types, particularly self-storage, data centers, and properties with credit-tenant net leases. More niche assets may require recourse or partial recourse guarantees."},
      {"q": "What documentation do specialty property lenders require?", "a": "In addition to standard commercial loan documentation, specialty property lenders typically require detailed operating statements showing business performance, management agreements, franchise or license documentation, and industry-specific underwriting metrics relevant to the asset class."}
    ]
  },
  "property_types": {
    "multifamily": [
      {"q": "What financing options are available for multifamily properties?", "a": "Multifamily properties enjoy the broadest financing options in commercial real estate, including agency loans (Fannie Mae, Freddie Mac), bank loans, life insurance company loans, CMBS, bridge loans, and construction financing. Agency programs offer the most competitive rates with non-recourse terms."},
      {"q": "What is the minimum size for a commercial multifamily loan?", "a": "Most commercial multifamily loans start at 5+ units, as 1-4 unit properties fall under residential lending guidelines. Loan amounts typically start at $500,000, with agency small loan programs starting at $750,000 and going up to $100M+ for larger portfolios."},
      {"q": "What are current multifamily loan rates?", "a": "Multifamily loan rates range from 5.34% to 8.25% depending on the lender type and deal specifics. Agency loans (Fannie Mae, Freddie Mac) offer the most competitive rates, typically 5.34% to 6.50% for stabilized properties with strong fundamentals."},
      {"q": "Can I finance manufactured housing communities?", "a": "Yes. Manufactured housing communities (mobile home parks) qualify for competitive financing from agency lenders, banks, and life insurance companies. Fannie Mae and Freddie Mac both have dedicated manufactured housing programs with favorable terms."},
      {"q": "What is the typical LTV for multifamily financing?", "a": "Multifamily LTV ratios range from 65% to 80%, depending on the lender type. Agency programs can offer up to 80% LTV, while banks and life companies typically cap at 70-75%. Bridge loans for value-add multifamily may go up to 75-80% of as-is value."},
      {"q": "How do I qualify for agency multifamily financing?", "a": "Agency financing (Fannie Mae, Freddie Mac) requires a stabilized property with minimum 90% occupancy, a debt service coverage ratio (DSCR) of 1.20x-1.25x minimum, a borrower with multifamily experience and strong net worth, and a property in good physical condition."}
    ],
    "industrial": [
      {"q": "What are the best financing options for industrial properties?", "a": "Industrial properties qualify for competitive financing from banks, life insurance companies, CMBS lenders, and debt funds. Life companies offer the best rates for stabilized assets, while banks provide flexibility for portfolio deals. Bridge and construction loans are available for value-add and development."},
      {"q": "What are current industrial loan rates?", "a": "Industrial loan rates range from 5.34% to 8.25% for permanent financing, with rates on the lower end for long-term credit-tenant net lease assets. Construction loans range from 6.79% to 10%+, and bridge loans fall in the 7-12% range depending on the transition strategy."},
      {"q": "Can I finance cold storage and food processing facilities?", "a": "Yes. Cold storage and food processing facilities qualify for commercial financing, though they require lenders experienced with the specialized infrastructure and operating requirements. CLS CRE has closed over $87M in cold storage and food processing deals."},
      {"q": "What is the typical LTV for industrial financing?", "a": "Industrial property LTV ratios range from 65% to 75% for permanent financing, with banks and life companies at the higher end for strong deals. Construction loans offer 65-80% of total project cost, and bridge loans provide 65-75% of as-is value."},
      {"q": "Do industrial properties qualify for SBA loans?", "a": "Yes. Owner-occupied industrial properties (where the business occupies at least 51% of the space) qualify for SBA 504 and 7(a) loans with up to 90% financing. This is ideal for manufacturing, distribution, and production companies purchasing their own facilities."},
      {"q": "How do lenders evaluate data center financing?", "a": "Data center financing is evaluated based on power infrastructure, connectivity, tenant quality, lease terms, and replacement cost. Lenders look for long-term leases with creditworthy tenants, redundant power and cooling systems, and strategic locations near fiber optic networks."}
    ],
    "retail": [
      {"q": "Is retail property still financeable?", "a": "Absolutely. While the retail sector has evolved, well-located properties with strong tenancy continue to attract competitive financing. Grocery-anchored centers, net lease properties with credit tenants, and experiential retail all remain highly financeable asset classes."},
      {"q": "What are the best financing sources for net lease retail?", "a": "Single-tenant net lease retail with investment-grade tenants is highly attractive to life insurance companies and CMBS lenders, offering the most competitive long-term fixed rates. Banks also compete aggressively for net lease deals with strong tenancy."},
      {"q": "What are current retail property loan rates?", "a": "Retail property loan rates range from 5.34% to 8.25% for permanent financing, with credit-tenant net lease assets at the lower end. Multi-tenant shopping centers may see rates at the higher end depending on tenancy strength and market location."},
      {"q": "Can I finance a restaurant with a commercial loan?", "a": "Restaurants can be financed through SBA 504/7(a) programs if owner-occupied, or through conventional commercial loans if the property is leased to a restaurant operator. Stand-alone restaurant properties are considered higher risk and may require specialized lenders."},
      {"q": "What do lenders look for in retail property underwriting?", "a": "Lenders evaluate tenant credit quality, lease terms and rollover schedule, in-place rent vs. market rent, anchor tenant presence, location and traffic counts, competitive landscape, and the property's physical condition and deferred maintenance."}
    ],
    "office": [
      {"q": "Can I still get financing for office buildings?", "a": "Yes. While office lending has tightened since the pandemic, well-located office properties with strong tenancy, long-term leases, and low vacancy continue to attract financing from banks, life companies, and CMBS lenders. The key is demonstrating stable cash flow and tenant quality."},
      {"q": "What are current office building loan rates?", "a": "Office building loan rates range from 5.75% to 8.50% for permanent financing, depending on property quality, tenancy, and market. Class A office in strong submarkets commands better terms than Class B/C in weaker markets."},
      {"q": "What are the challenges of financing office in the current market?", "a": "Key challenges include remote work uncertainty, higher vacancy rates in many markets, tenant downsizing trends, and increased lender scrutiny of lease rollover risk. Properties with long-term leases to creditworthy tenants in strong submarkets remain financeable."},
      {"q": "Can I get SBA financing for an owner-occupied office?", "a": "Yes. SBA 504 and 7(a) loans are excellent options for businesses purchasing their own office space. With up to 90% financing and below-market rates, SBA programs are ideal for professional service firms, medical practices, and other owner-occupiers."},
      {"q": "How do lenders evaluate medical office properties?", "a": "Medical office is underwritten more favorably than general office due to higher tenant stickiness (practices invest heavily in buildout), longer lease terms, and recession-resistant demand. Lenders may offer higher LTV and lower rates for medical office compared to general office."}
    ],
    "mixed-use": [
      {"q": "How do lenders underwrite mixed-use properties?", "a": "Lenders evaluate each component of a mixed-use property separately (residential, retail, office) and then blend the analysis. Properties with 80%+ residential may qualify for agency financing. The commercial component is underwritten based on in-place leases and market rent comparisons."},
      {"q": "What are the financing challenges for mixed-use properties?", "a": "Mixed-use properties can be challenging because they straddle multiple underwriting frameworks. Lenders need to be comfortable with each use type, and the blended analysis may result in more conservative terms than a single-use property. Finding the right lender is key."},
      {"q": "Can mixed-use properties qualify for agency financing?", "a": "Mixed-use properties with at least 80% residential use (by income or square footage) may qualify for Fannie Mae or Freddie Mac financing, benefiting from agency rates and non-recourse terms. The commercial component must comply with agency guidelines."},
      {"q": "What are current mixed-use property loan rates?", "a": "Mixed-use property loan rates range from 5.50% to 8.50% depending on the lender, property composition, and market. Agency-eligible mixed-use (80%+ residential) can access rates in the 5.50% to 6.75% range."},
      {"q": "Is construction financing available for mixed-use development?", "a": "Yes. Mixed-use construction loans are available from banks, debt funds, and private lenders. These projects typically require 20-35% borrower equity (65-80% loan-to-cost), strong development experience, and a clear permanent financing or sale exit strategy."}
    ],
    "hospitality": [
      {"q": "How do lenders evaluate hotel financing?", "a": "Hotel lenders evaluate revenue per available room (RevPAR), occupancy rates, average daily rate (ADR), brand affiliation, management quality, competitive set positioning, market supply/demand dynamics, and the property's physical condition and capital expenditure needs."},
      {"q": "What are current hotel financing rates?", "a": "Hotel loan rates range from 6.00% to 9.00%+ for permanent financing, with flagged properties at the lower end and independent hotels at the higher end. Bridge and renovation loans range from 8.00% to 13.00% depending on the transition plan."},
      {"q": "Can I use SBA financing for a hotel?", "a": "Yes. Owner-operated hotels qualify for SBA 504 and 7(a) financing with up to 85-90% leverage. This is ideal for smaller, independent hotels where the owner actively operates the business. Flagged hotels may also qualify if the owner meets SBA requirements."},
      {"q": "Is hospitality financing more expensive than other property types?", "a": "Generally yes. Hotels are considered higher risk due to their operating business nature and revenue volatility. Rates are typically 50-200 basis points higher than comparable multifamily or industrial financing, and leverage may be more conservative."},
      {"q": "What is the minimum DSCR for hotel financing?", "a": "Most hotel lenders require a minimum debt service coverage ratio (DSCR) of 1.35x to 1.50x, compared to 1.20x to 1.25x for stabilized multifamily or industrial properties. Higher DSCR requirements reflect the operating business risk inherent in hospitality assets."}
    ]
  },
  "city_templates": {
    "financing": [
      {"q": "What are the best commercial lenders in {city}?", "a": "The best commercial lenders in {city} depend on your property type and loan needs. CLS CRE works with 1,000+ banks, life insurance companies, debt funds, CMBS conduits, and agency lenders to find the most competitive {loan_type} financing for your {city} property. Contact us for a customized lender recommendation."},
      {"q": "What are current {loan_type} rates in {city}?", "a": "Current {loan_type} rates in {city} range from {rate_low} to {rate_high}, depending on the lender, property type, and borrower qualifications. Rates in the {metro} market are influenced by local market conditions, property quality, and competition among lenders."},
      {"q": "How long does it take to close a commercial loan in {city}?", "a": "Commercial loan closings in {city} typically take 45-90 days for permanent financing and 2-4 weeks for bridge loans. Timelines depend on the lender type, property complexity, and local requirements such as environmental reviews and appraisal turnaround times."},
      {"q": "Do I need a local lender for {city} commercial real estate?", "a": "Not necessarily. While local banks and credit unions in {city} offer relationship-based lending, national lenders (life companies, CMBS, agency) often provide more competitive rates and terms. CLS CRE sources capital from both local and national lenders to find the best fit."},
      {"q": "What property types are most financeable in {city}?", "a": "In the {metro} market, the most financeable property types currently include multifamily apartments, industrial warehouses, and well-tenanted retail — all driven by strong local demand and favorable lender appetite. Contact CLS CRE for a market-specific financing assessment."}
    ],
    "property": [
      {"q": "What financing is available for {property_type} in {city}?", "a": "{property_type} properties in {city} can access financing from banks, life insurance companies, CMBS lenders, debt funds, and agency programs (for multifamily). Rates and terms depend on the specific property, tenancy, and borrower profile. CLS CRE provides customized options for the {metro} market."},
      {"q": "What are current {property_type} loan rates in {city}?", "a": "Current {property_type} loan rates in {city} range based on the financing type: permanent loans from 5.34% to 8.25%, bridge loans from 6.79% to 13.04%, and construction loans from 6.79% to 13.04%. Contact CLS CRE for rate quotes specific to your property."},
      {"q": "How is the {property_type} market in {city}?", "a": "The {property_type} market in the {metro} area benefits from {context_snippet}. Contact CLS CRE for a detailed market assessment and financing options for your {city} {property_type} property."},
      {"q": "Can I get non-recourse financing for {property_type} in {city}?", "a": "Non-recourse financing is available for qualifying {property_type} properties in {city} from life insurance companies, CMBS conduits, and select debt funds. Requirements include sufficient property value, strong cash flow, and experienced borrower sponsorship."},
      {"q": "What is the minimum loan amount for {property_type} in {city}?", "a": "Commercial loans for {property_type} properties in {city} typically start at $500,000 for bank financing and $750,000 for agency programs. SBA loans start at $250,000 for qualifying owner-occupied properties. Contact CLS CRE for options specific to your deal size."}
    ]
  }
}
